# Install command-line tools using Homebrew
# Usage:
# brew update
# brew upgrade
# brew install mas #used to grab packages from Mac App Store
# brew bundle

# Extra Repos
tap  'buo/cask-upgrade'

# Install GNU core utilities (those that come with OS X are outdated)
# Don’t forget to add `$(brew --prefix coreutils)/libexec/gnubin` to `$PATH`.
brew 'coreutils'
# Install some other useful utilities like `sponge`
brew 'moreutils'
# Install GNU `find`, `locate`, `updatedb`, and `xargs`, `g`-prefixed
brew 'findutils'
# Install GNU `sed`
brew 'gnu-sed'

# Install other useful binaries
brew 'ack'
brew 'ctags'
brew 'cmake'
brew 'curl'
brew 'diff-so-fancy' # nicer diffs
brew 'exiftool'
brew 'ffmpeg'
brew 'fzf'
brew 'git'
brew 'go'
brew 'imagemagick', args: ['with-webp']
brew 'jhead'
brew 'jpegoptim'
brew 'lynx'
brew 'macvim'
brew 'nodejs' # This installs `npm` too using the recommended installation method
brew 'optipng'
brew 'p7zip'
brew 'plenv'
brew 'perl-build'
brew 'pigz' # multi-processor gzip
brew 'python'
brew 'python-setuptools'
brew 'readline'
brew 'rename'
brew 'ssh-copy-id'
brew 'tag'
brew 'the_silver_searcher'
brew 'thefuck'
brew 'tree'
brew 'vim'
brew 'wget'
brew 'yt-dlp'

# Stuff I haven't used in a while
# brew 'shellcheck'
# brew 'sqlmap' # pen test tool for SQL vulnerabilies
# brew 'tflint' #terraform linter
# brew 'tmux'
# brew 'webkit2png'

# Casks
cask 'bettertouchtool'
cask 'chrome'
cask 'dropbox'
cask 'disk-inventory-x'
cask 'firefox'
cask 'imageoptim'
cask 'istat-menus'
cask 'iterm2'
cask 'macdown'
cask 'qlcolorcode'    # Quicklook plugin for code colorizing
cask 'qlimagesize'    # Quicklook plugin for image sizes
cask 'qlmarkdown'     # Quicklook plugin for mark down
cask 'quicklook-json' # Quicklook plugin for JSON formatting
cask 'slack'
cask 'steam'
# cask 'scroll-reverser' #allows mouse and trackpad to have separate scroll directions
cask 'transmission'
cask 'viscosity' # https://sparklabs.com/viscosity VPN client
cask 'vlc'

# Mac App Store
mas "Amphetamin", id: 937984704
mas "Adblock Plus for Safari ABP", id: 1432731683
mas "1Password for Safari", id: 1569813296
mas "Affinity Publisher 2", id: 1606941598
mas "Affinity Designer 2", id: 1616831348
mas "Affinity Photo 2: Image Editor", id: 1616822987
mas "Super Vectorizer Pro:AI Vector", id: 1152204742
mas "Telegram", id: 747648890
mas "WhatsApp Messenger", id: 310633997
mas "Slack for Desktop", id: 803453959
mas "Blackmagic Disk Speed Test", id: 425264550

# Home Automation stuff -- just on personal devices
# mas "HomeCam for HomeKit", id: 1292995895
# mas "Homie—Menu Bar App for HomeKit", id: 1533590432
# mas "Controller for HomeKit", id: 1198176727
# mas "UnderTheWX", id: 1078013186
